app/controllers/events_controller.rb

	def create
		byebug
		@event = Event.new(event_params)

		if @event.save
---
INSERT INTO "events" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "novo evento"], ["created_at", "2023-09-26 22:57:05.527816"], ["updated_at", "2023-09-26 22:57:05.527816"]]