app/controllers/lectures_controller.rb

  def create
    @lecture = Lecture.new(lecture_params)

    if @lecture.save
---
INSERT INTO "lectures" ("name", "lecture_minutes", "lightning", "event_id", "allocated", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "teste"], ["lecture_minutes", 30], ["lightning", true], ["event_id", 1], ["allocated", nil], ["created_at", "2023-09-26 23:28:02.373269"], ["updated_at", "2023-09-26 23:28:02.373269"]]