app/models/event.rb

	def organizer_event
		track_count = 0
		total_lectured = self.lectures.where(allocated: false).size

		while total_lectured >= 0
			track_add = track_to_use;

			self.lectures.where(allocated: false).each do |lecture|
				lecture_minutes = lecture.lecture_minutes

				if (@track_allocated_time + lecture_minutes.minutes <= Time.current.beginning_of_day + 12.hours) && (@track_allocated_time + lecture_minutes.minutes <= Time.current.beginning_of_day + 16.hours)
					new_lecture = track_add.lectures_by_track.create!(lecture_id: lecture.id, start_time: @track_allocated_time)
					@track_allocated_time += lecture_minutes.minutes
					lecture.allocated = true
					lecture.save!
---
SELECT COUNT(*) FROM "lectures" WHERE "lectures"."event_id" = $1 AND "lectures"."allocated" = $2  [["event_id", 1], ["allocated", false]]
SELECT "lectures".* FROM "lectures" WHERE "lectures"."event_id" = $1 AND "lectures"."allocated" = $2  [["event_id", 1], ["allocated", false]]
INSERT INTO "lecture_by_tracks" ("lecture_id", "track_id", "start_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["lecture_id", 64], ["track_id", 11], ["start_time", "09:00:00"], ["created_at", "2023-09-27 00:07:52.121618"], ["updated_at", "2023-09-27 00:07:52.121618"]]
INSERT INTO "lecture_by_tracks" ("lecture_id", "track_id", "start_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["lecture_id", 40], ["track_id", 10], ["start_time", "09:00:00"], ["created_at", "2023-09-27 00:04:50.151951"], ["updated_at", "2023-09-27 00:04:50.151951"]]
UPDATE "lectures" SET "allocated" = $1, "updated_at" = $2 WHERE "lectures"."id" = $3  [["allocated", true], ["updated_at", "2023-09-27 00:07:52.126362"], ["id", 64]]

	def track_to_use
		if !self.tracks.any? || self.tracks.last.finished?
			track_count = self.tracks.size
			track_add = self.tracks.create!(name: "Track #{track_count + 1}", finished: false)
			@track_allocated_time = Time.current.beginning_of_day + 9.hours
		else
			track_add = self.tracks.last
---
SELECT COUNT(*) FROM "tracks" WHERE "tracks"."event_id" = $1  [["event_id", 4]]
INSERT INTO "tracks" ("name", "event_id", "finished", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Track 1"], ["event_id", 4], ["finished", false], ["created_at", "2023-09-27 00:04:50.086768"], ["updated_at", "2023-09-27 00:04:50.086768"]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."event_id" = $1 ORDER BY "tracks"."id" DESC LIMIT $2  [["event_id", 1], ["LIMIT", 1]]