app/models/event.rb

	def organizer_event
		track_count = 0

		self.lectures.each do |lecture|
			track_add = self.tracks.last.finished? ? self.tracks.last : self.tracks.last
---
SELECT "lectures".* FROM "lectures" WHERE "lectures"."event_id" = $1  [["event_id", 1]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."event_id" = $1 LIMIT $2  [["event_id", 1], ["LIMIT", 11]]