app/models/lecture.rb

	def set_lecture_minutes
		self.update_column(:lecture_minutes, 5)
---
UPDATE "lectures" SET "lecture_minutes" = $1 WHERE "lectures"."id" = $2  [["lecture_minutes", 5], ["id", 1]]